Filtering Data

In [1]:
import pandas as pd

bios = pd.read_csv('./data/bios.csv')
coffee = pd.read_csv('./data/coffee.csv')

In [2]:
bios.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  object
 2   born_date     143693 non-null  object
 3   born_city     110908 non-null  object
 4   born_region   110908 non-null  object
 5   born_country  110908 non-null  object
 6   NOC           145499 non-null  object
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   object
dtypes: float64(2), int64(1), object(7)
memory usage: 11.1+ MB

In [3]:
#to filter data by value of specific column and show all columns
bios.loc[bios['height_cm'] > 220]
#to show specific columns
bios.loc[bios['height_cm'] > 220,["name", 'height_cm']]

                   name  height_cm
5673     Gunther Behnke      221.0
5781     Tommy Burleson      223.0
6978    Arvydas Sabonis      223.0
89070          Yao Ming      226.0
89075    Roberto Dueñas      221.0
120266     Zhang Zhaoxu      221.0

In [23]:
#you dont have to use loc
bios[bios['height_cm'] > 220]
#to select columns in this case
bios[bios['height_cm'] > 220][['name','height_cm']]

                   name  height_cm
5673     Gunther Behnke      221.0
5781     Tommy Burleson      223.0
6978    Arvydas Sabonis      223.0
89070          Yao Ming      226.0
89075    Roberto Dueñas      221.0
120266     Zhang Zhaoxu      221.0

In [24]:
#to add another condition
bios[(bios['height_cm'] > 215) & (bios['born_country']=='USA')]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
5781,5804,Tommy Burleson,1952-02-24,Crossnore,North Carolina,USA,United States,223.0,102.0,NaN
6722,6755,Shaquille O'Neal,1972-03-06,Newark,New Jersey,USA,United States,216.0,137.0,NaN
6937,6972,David Robinson,1965-08-06,Key West,Florida,USA,United States,216.0,107.0,NaN
123850,126093,Tyson Chandler,1982-10-02,Hanford,California,USA,United States,216.0,107.0,NaN

In [6]:
#like condition
bios[bios['name'].str.contains('mateusz|kamil', case=False)]
#you can use regular expressions here: mateusz|kamil'
#to switch off regex use
bios[bios['name'].str.contains('mateusz', case=False, regex=False)]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
62219,62679,Mateusz Kusznierewicz,1975-04-29,Warszawa (Warsaw),Mazowieckie,POL,Poland,193.0,100.0,NaN
108715,109881,Mateusz Ligocki,1982-06-18,Cieszyn,Śląskie,POL,Poland,171.0,78.0,NaN
112483,113746,Mateusz Jachlewski,1984-12-27,Gdynia,Pomorskie,POL,Poland,184.0,88.0,NaN
114599,115912,Mateusz Sawrymowicz,1987-04-22,Lublin,Lubelskie,POL,Poland,185.0,75.0,NaN
115755,117122,Mateusz Gucman,1980-04-19,Głubczyce,Opolskie,POL,Poland,183.0,96.0,NaN
117594,119101,Mateusz Chruściński,1987-11-29,Katowice,Śląskie,POL,Poland,178.0,77.0,NaN
120452,122369,Mateusz Polaczyk,1988-01-22,Limanowa,Małopolskie,POL,Poland,178.0,75.0,NaN
125906,128256,Mateusz Garniewicz,1990-01-15,Poznań,Wielkopolskie,POL,Poland,175.0,77.0,NaN
131343,134120,Mateusz Przybylko,1992-03-09,Bielefeld,Nordrhein-Westfalen,GER,Germany,195.0,78.0,NaN
132608,135489,Mateusz Kamiński,1991-05-03,Olsztyn,Warmińsko-Mazurskie,POL,Poland,189.0,83.0,NaN
132618,135500,Mateusz Kus,1987-07-14,Piekary,Śląskie,POL,Poland,200.0,112.0,NaN
132626,135509,Mateusz Biskup,1994-02-08,Gdańsk,Pomorskie,POL,Poland,190.0,91.0,NaN
132627,135510,Mateusz Wilangowski,1991-10-07,Mokre,Kujawsko-Pomorskie,POL,Poland,195.0,89.0,NaN
132653,135537,Mateusz Bieniek,1994-04-05,Blachownia,Śląskie,POL,Poland,210.0,98.0,NaN
132654,135538,Mateusz Mika,1991-01-21,Kobiernice,Śląskie,POL,Poland,207.0,85.0,NaN
134809,137907,Mateusz Luty,1990-01-01,Kowary,Dolnośląskie,POL,Poland,189.0,95.0,NaN
134821,137919,Mateusz Sochowicz,1996-02-28,Wrocław,Dolnośląskie,POL,Poland,184.0,84.0,NaN
136651,139882,Mateusz Jarosz,2002-04-22,NaN,NaN,NaN,Poland,NaN,NaN,NaN
137018,140254,Mateusz Krzemiński,2002-08-30,NaN,NaN,NaN,Poland,NaN,NaN,NaN
142363,145967,Mateusz Rzeźniczak,1998-07-23,NaN,NaN,NaN,Poland,NaN,NaN,NaN
142377,145982,Mateusz Rudyk,1995-07-20,NaN,NaN,NaN,Poland,NaN,NaN,NaN

In [10]:
#there are other methods than 'contains'
bios[bios['born_country'].isin(['UKR','POL'])]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
217,218,Kálmán Kirchmayer,1897-11-15,Rzeszów,Podkarpackie,POL,Hungary,NaN,NaN,1990-11-06
503,505,Ursula Büschking,1941-09-23,Braniewo,Warmińsko-Mazurskie,POL,West Germany,169.0,55.0,NaN
515,517,Willi Gabriel,1939-09-24,Owiesno,Dolnośląskie,POL,West Germany,165.0,63.0,NaN
935,939,Larisa Savčenko-Neilande,1966-07-21,Lviv,Lviv,UKR,Latvia Soviet Union,169.0,61.0,NaN
1061,1068,Bożena Bąk,1966-01-28,Głubczyce,Opolskie,POL,Poland,180.0,70.0,NaN
...,...,...,...,...,...,...,...,...,...,...
145331,149053,Dmytro Kotovskyi,2001-11-08,Rivne,Rivne,UKR,Ukraine,NaN,NaN,NaN
145333,149055,Sofiya Holichenko,2004-11-23,Kyiv,Kyiv,UKR,Ukraine,NaN,NaN,NaN
145337,149059,Uliana Dubrova,2002-04-03,Kharkiv,Kharkiv,UKR,Ukraine,NaN,NaN,NaN
145338,149060,Oleh Handei,1999-03-05,Kyiv,Kyiv,UKR,Ukraine,NaN,NaN,NaN
145463,149190,Vladimir Tkachyov,1993-10-05,Dnipro,Dnipropetrovsk,UKR,ROC,183.0,84.0,NaN

In [27]:
#can combine methods
bios[bios['born_country'].isin(['GBR']) & (bios['name'].str.startswith('Keith'))]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
3505,3517,Keith Wallace,1961-03-29,Preston,England,GBR,Great Britain,165.0,51.0,1999-12-31
12053,12118,Keith Hervey,1898-11-03,Fulham,England,GBR,Great Britain,NaN,NaN,1973-02-22
14577,14674,Keith Harrison,1933-03-28,Birmingham,England,GBR,Great Britain,NaN,NaN,NaN
16166,16281,Keith Reynolds,1963-12-25,Solihull,England,GBR,Great Britain,173.0,68.0,NaN
18734,18862,Keith Sinclair,1945-06-26,Sunderland,England,GBR,Great Britain,190.0,79.0,NaN
29897,30123,Keith Langley,1961-06-03,Aldershot,England,GBR,Great Britain,173.0,70.0,NaN
34011,34275,Keith Remfry,1947-11-17,Ealing,England,GBR,Great Britain,193.0,114.0,2015-09-16
46885,47234,Keith Collin,1937-01-18,Marylebone,England,GBR,Great Britain,168.0,63.0,1991-03-06
55317,55712,Keith Boxell,1958-05-06,Clapham,England,GBR,Great Britain,170.0,87.0,NaN
57818,58226,Keith Peache,1947-08-10,Lewisham,England,GBR,Great Britain,180.0,98.0,NaN
61748,62202,Keith Grogono,1912-11-04,Stratford,England,GBR,Great Britain,NaN,NaN,1999-03-22
62620,63086,Keith Musto,1936-01-12,Rochford,England,GBR,Great Britain,174.0,72.0,NaN
68324,68841,Keith Angus,1943-04-05,Sheffield,England,GBR,Great Britain,170.0,59.0,NaN
68472,68989,Keith Cullen,1972-06-13,Ilford,England,GBR,Great Britain,177.0,61.0,NaN
68997,69514,Keith Stock,1957-03-18,Woolwich,England,GBR,Great Britain,176.0,73.0,NaN
95267,96037,Keith Oliver,1947-10-27,Liverpool,England,GBR,Great Britain,172.0,68.0,NaN
96452,97229,Keith Schellenberg,1929-03-13,Middlesbrough,England,GBR,Great Britain,NaN,NaN,2019-10-28

In [28]:
#other way to do this is to use 'query' function
bios.query('born_country == "USA" and born_city=="Seattle"')

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
11030,11088,David Halpern,1955-08-18,Seattle,Washington,USA,United States,178.0,79.0,NaN
12800,12870,Todd Trewin,1958-04-20,Seattle,Washington,USA,United States,180.0,75.0,NaN
15476,15583,Scott McKinley,1968-10-15,Seattle,Washington,USA,United States,183.0,75.0,NaN
29079,29293,Joyce Tanac,1950-09-27,Seattle,Washington,USA,United States,156.0,49.0,NaN
31135,31371,Bill Kuhlemeier,1908-01-14,Seattle,Washington,USA,United States,NaN,NaN,2001-07-08
...,...,...,...,...,...,...,...,...,...,...
133392,136331,Hans Struzyna,1989-03-31,Seattle,Washington,USA,United States,188.0,91.0,NaN
135448,138662,Maude Davis Crossland,2003-03-19,Seattle,Washington,USA,Colombia,NaN,NaN,NaN
136993,140229,Jenell Berhorst,2003-12-13,Seattle,Washington,USA,United States,NaN,NaN,NaN
143507,147159,Nevin Harrison,2002-06-02,Seattle,Washington,USA,United States,175.0,73.0,NaN
145446,149169,Corinne Stoddard,2001-08-15,Seattle,Washington,USA,United States,NaN,NaN,NaN

In [33]:
#adding/removing columns
coffee['price'] = 4.99
coffee.head()

         Day Coffee Type  Units Sold  price
0     Monday    Espresso          25   4.99
1     Monday       Latte          15   4.99
2    Tuesday    Espresso          30   4.99
3    Tuesday       Latte          20   4.99
4  Wednesday    Espresso          35   4.99

In [35]:
#conditions in new  column
import numpy as np

coffee['new_price'] = np.where(coffee['Coffee Type']=='Espresso',3.99,5.99)
coffee.head()

         Day Coffee Type  Units Sold  price  new_price
0     Monday    Espresso          25   4.99       3.99
1     Monday       Latte          15   4.99       5.99
2    Tuesday    Espresso          30   4.99       3.99
3    Tuesday       Latte          20   4.99       5.99
4  Wednesday    Espresso          35   4.99       3.99

In [38]:
#dropping column
coffee.drop(columns=['price'])
#it deesnt modify coffee df only returns new one

          Day Coffee Type  Units Sold  new_price
0      Monday    Espresso          25       3.99
1      Monday       Latte          15       5.99
2     Tuesday    Espresso          30       3.99
3     Tuesday       Latte          20       5.99
4   Wednesday    Espresso          35       3.99
5   Wednesday       Latte          25       5.99
6    Thursday    Espresso          40       3.99
7    Thursday       Latte          30       5.99
8      Friday    Espresso          45       3.99
9      Friday       Latte          35       5.99
10   Saturday    Espresso          45       3.99
11   Saturday       Latte          35       5.99
12     Sunday    Espresso          45       3.99
13     Sunday       Latte          35       5.99

In [43]:
#dropping column for called df
# coffee.drop(columns=['price'],inplace=True)
# its the same like this
# coffee = coffee.drop(columns=['price']
coffee.head()

         Day Coffee Type  Units Sold  new_price  amount
0     Monday    Espresso          25       3.99       5
1     Monday       Latte          15       5.99       5
2    Tuesday    Espresso          30       3.99       5
3    Tuesday       Latte          20       5.99       5
4  Wednesday    Espresso          35       3.99       5

In [41]:
#pandas is storing one version of df in memory 
coffee_new = coffee
coffee_new['amount'] = 5
coffee.head()

         Day Coffee Type  Units Sold  new_price  amount
0     Monday    Espresso          25       3.99       5
1     Monday       Latte          15       5.99       5
2    Tuesday    Espresso          30       3.99       5
3    Tuesday       Latte          20       5.99       5
4  Wednesday    Espresso          35       3.99       5

In [42]:
#to avoid it use copy function
coffee_new = coffee.copy()
coffee_new['storage'] = 1
coffee.head()

         Day Coffee Type  Units Sold  new_price  amount
0     Monday    Espresso          25       3.99       5
1     Monday       Latte          15       5.99       5
2    Tuesday    Espresso          30       3.99       5
3    Tuesday       Latte          20       5.99       5
4  Wednesday    Espresso          35       3.99       5

In [50]:
#to select specific columns
coffee = coffee[['Day','Coffee Type','Units Sold','new_price']]
coffee.head()

         Day Coffee Type  Units Sold  new_price
0     Monday    Espresso          25       3.99
1     Monday       Latte          15       5.99
2    Tuesday    Espresso          30       3.99
3    Tuesday       Latte          20       5.99
4  Wednesday    Espresso          35       3.99

In [52]:
#you can have calculations in the column definition
coffee['revenue'] = coffee['Units Sold'] * coffee['new_price']
coffee.head()

         Day Coffee Type  Units Sold  new_price  revenue
0     Monday    Espresso          25       3.99    99.75
1     Monday       Latte          15       5.99    89.85
2    Tuesday    Espresso          30       3.99   119.70
3    Tuesday       Latte          20       5.99   119.80
4  Wednesday    Espresso          35       3.99   139.65

In [56]:
#to rename a column
coffee.rename(columns={'new_price':'price'},inplace=True)
coffee.head()

         Day Coffee Type  Units Sold  price  revenue
0     Monday    Espresso          25   3.99    99.75
1     Monday       Latte          15   5.99    89.85
2    Tuesday    Espresso          30   3.99   119.70
3    Tuesday       Latte          20   5.99   119.80
4  Wednesday    Espresso          35   3.99   139.65